import 'package:get/get.dart';

class ChatController extends GetxController {
  var message = <Map<String, String>>[
    {"role": "bot","content":"مرحبا، كيف يمكنني مساعدتك اليوم؟"},
    {"role": "user","content":"سبب تسوس في زراعة الطماطم بمزرعتي؟"},
    {"role": "bot","content":"السبب الرئيسي لحدوث تسوس في زراعة الطماطم هو الرطوبة الزائدة في التربة، والتي تؤدي إلى تكاثر الفطريات المسببة للمرض. للتخلص من هذه المشكلة، يمكنك تقليل كمية الماء التي تروي بها النباتات، والتأكد من تهوية المزرعة بشكل جيد."},
    {"role": "user","content":"كيف يمكنني تقليل كمية الماء التي أروي بها النباتات؟"},
    {"role": "bot","content":"يمكنك تقليل كمية الماء التي تروي بها النباتات عن طريق تحديد كمية الماء التي تحتاجها النباتات، والتأكد من عدم إعطائها كمية زائدة من الماء. يمكنك أيضًا تقليل كمية الماء التي تروي بها النباتات عن طريق تقليل عدد مرات الري، وزيادة فترة التوقف بين كل رية وأخرى."},
    
  ].obs; 
  void addMessage(String role, String content) {
    message.add({"role": role, "content": content});
  }

}